[
 {
   "ids": "3455-2339-6554-5156-4260-4428-",
   "sanad": "حدثنا الحميدي عبد الله بن الزبير ، قال: حدثنا سفيان ، قال: حدثنا يحيى بن سعيد الأنصاري ، قال: محمد بن إبراهيم التيمي : أنه سمع علقمة بن وقاص الليثي ، يقول: سمعت عمر بن الخطاب رضي الله عنه على المنبر ، قال: سمعت رسول الله صلى الله عليه وسلم ، يقول:",
   "matn": "إنما الأعمال بالنيات ، وإنما لكل امرئ ما نوى ، فمن كانت هجرته إلى دنيا يصيبها ، أو إلى امرأة ينكحها ، فهجرته إلى ما هاجر إليه"
 },
 {
   "ids": "3784-5077-6336-4132-2864-",
   "sanad": "حَدَّثَنَا عَبْدُ اللهِ بْنُ يُوسُفَ ، قَالَ: أَخْبَرَنَا مَالِكٌ ، عَنْ هِشَامِ بْنِ عُرْوَةَ ، عَائِشَةَ أُمِّ الْمُؤْمِنِينَ رَضِيَ اللهُ عَنْهَا:",
   "matn": "أَنَّ الْحَارِثَ بْنَ هِشَامٍ رَضِيَ اللهُ عَنْهُ سَأَلَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا رَسُولَ اللهِ ، كَيْفَ يَأْتِيكَ الْوَحْيُ؟ فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: أَحْيَانًا يَأْتِينِي مِثْلَ صَلْصَلَةِ الْجَرَسِ ، وَهُوَ أَشَدُّهُ عَلَيَّ ، فَيَفْصِمُ عَنِّي وَقَدْ وَعَيْتُ عَنْهُ مَا قَالَ ، وَأَحْيَانًا يَتَمَثَّلُ لِيَ الْمَلَكُ رَجُلًا ، فَيُكَلِّمُنِي فَأَعِي مَا يَقُولُ .[1/7] قَالَتْ عَائِشَةُ رَضِيَ اللهُ عَنْهَا: وَلَقَدْ رَأَيْتُهُ يَنْزِلُ عَلَيْهِ الْوَحْيُ فِي الْيَوْمِ الشَّدِيدِ الْبَرْدِ ، فَيَفْصِمُ عَنْهُ وَإِنَّ جَبِينَهُ لَيَتَفَصَّدُ عَرَقًا"
 },
 {
   "ids": "6574-5065-4211-5595-4132-2864-",
   "sanad": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ ، قَالَ: حَدَّثَنَا اللَّيْثُ ، عَنْ عُقَيْلٍ ، عَنِ ابْنِ شِهَابٍ عُرْوَةَ بْنِ الزُّبَيْرِ ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ أَنَّهَا قَالَتْ:",
   "matn": "أَوَّلُ مَا بُدِئَ بِهِ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنَ الْوَحْيِ الرُّؤْيَا الصَّالِحَةُ فِي النَّوْمِ ، فَكَانَ لَا يَرَى رُؤْيَا إِلَّا جَاءَتْ مِثْلَ فَلَقِ الصُّبْحِ ، ثُمَّ حُبِّبَ إِلَيْهِ الْخَلَاءُ ، وَكَانَ يَخْلُو بِغَارِ حِرَاءٍ ، فِيهِ وَهُوَ التَّعَبُّدُ اللَّيَالِيَ ذَوَاتِ الْعَدَدِ قَبْلَ أَنْ يَنْزِعَ إِلَى أَهْلِهِ ، وَيَتَزَوَّدُ لِذَلِكَ ، ثُمَّ يَرْجِعُ إِلَى خَدِيجَةَ فَيَتَزَوَّدُ لِمِثْلِهَا ، حَتَّى جَاءَهُ الْحَقُّ وَهُوَ فِي غَارِ حِرَاءٍ ، فَجَاءَهُ الْمَلَكُ فَقَالَ: اقْرَأْ ، قَالَ: مَا أَنَا بِقَارِئٍ. قَالَ: فَأَخَذَنِي فَغَطَّنِي حَتَّى بَلَغَ مِنِّي ، ثُمَّ أَرْسَلَنِي فَقَالَ: اقْرَأْ ، قُلْتُ مَا أَنَا بِقَارِئٍ ، فَأَخَذَنِي فَغَطَّنِي الثَّانِيَةَ حَتَّى بَلَغَ مِنِّي الْجَهْدُ ، ثُمَّ أَرْسَلَنِي فَقَالَ: اقْرَأْ ، فَقُلْتُ مَا أَنَا بِقَارِئٍ ، فَأَخَذَنِي فَغَطَّنِي الثَّالِثَةَ ، ثُمَّ أَرْسَلَنِي فَقَالَ: { اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ * خَلَقَ الإِنْسَانَ مِنْ عَلَقٍ * اقْرَأْ وَرَبُّكَ الأَكْرَمُ } فَرَجَعَ بِهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَرْجُفُ فُؤَادُهُ ، فَدَخَلَ عَلَى خَدِيجَةَ بِنْتِ خُوَيْلِدٍ رَضِيَ اللهُ عَنْهَا فَقَالَ: زَمِّلُونِي زَمِّلُونِي فَزَمَّلُوهُ حَتَّى ذَهَبَ عَنْهُ الرَّوْعُ ، فَقَالَ لِخَدِيجَةَ وَأَخْبَرَهَا الْخَبَرَ: لَقَدْ خَشِيتُ عَلَى نَفْسِي فَقَالَتْ خَدِيجَةُ : كَلَّا وَاللهِ مَا يُخْزِيكَ اللهُ أَبَدًا ، إِنَّكَ لَتَصِلُ الرَّحِمَ ، وَتَحْمِلُ الْكَلَّ ، وَتَكْسِبُ الْمَعْدُومَ ، وَتَقْرِي الضَّيْفَ ، وَتُعِينُ عَلَى نَوَائِبِ الْحَقِّ. فَانْطَلَقَتْ بِهِ خَدِيجَةُ حَتَّى أَتَتْ بِهِ وَرَقَةَ بْنَ نَوْفَلِ بْنِ أَسَدِ بْنِ عَبْدِ الْعُزَّى ، ابْنَ عَمِّ خَدِيجَةَ ، وَكَانَ امْرَأً تَنَصَّرَ فِي الْجَاهِلِيَّةِ ، وَكَانَ يَكْتُبُ الْكِتَابَ الْعِبْرَانِيَّ ، فَيَكْتُبُ مِنَ الْإِنْجِيلِ بِالْعِبْرَانِيَّةِ مَا شَاءَ اللهُ أَنْ يَكْتُبَ ، وَكَانَ شَيْخًا كَبِيرًا قَدْ عَمِيَ ، فَقَالَتْ لَهُ خَدِيجَةُ : يَا ابْنَ عَمِّ ، اسْمَعْ مِنَ ابْنِ أَخِيكَ. فَقَالَ لَهُ وَرَقَةُ : يَا ابْنَ أَخِي مَاذَا تَرَى؟ فَأَخْبَرَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَبَرَ مَا رَأَى ، فَقَالَ لَهُ وَرَقَةُ: هَذَا النَّامُوسُ الَّذِي نَزَّلَ اللهُ عَلَى مُوسَى ، يَا لَيْتَنِي فِيهَا جَذَعًا ، لَيْتَنِي أَكُونُ حَيًّا إِذْ يُخْرِجُكَ قَوْمُكَ ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: أَوَمُخْرِجِيَّ هُمْ ؟! قَالَ: نَعَمْ. لَمْ يَأْتِ رَجُلٌ قَطُّ بِمِثْلِ مَا جِئْتَ بِهِ إِلَّا عُودِيَ ، وَإِنْ يُدْرِكْنِي يَوْمُكَ أَنْصُرْكَ نَصْرًا مُؤَزَّرًا . ثُمَّ لَمْ يَنْشَبْ وَرَقَةُ أَنْ تُوُفِّيَ ، وَفَتَرَ الْوَحْيُ ."
 },
 {
   "ids": "5595-3542-1019-",
   "sanad": "قَالَ ابْنُ شِهَابٍ : وَأَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ : أَنَّ جَابِرَ بْنَ عَبْدِ اللهِ الْأَنْصَارِيَّ قَالَ ، وَهُوَ يُحَدِّثُ عَنْ فَتْرَةِ الْوَحْيِ ، فَقَالَ فِي حَدِيثِهِ:",
   "matn": "بَيْنَا أَنَا أَمْشِي إِذْ سَمِعْتُ صَوْتًا مِنَ السَّمَاءِ فَرَفَعْتُ بَصَرِي ، فَإِذَا الْمَلَكُ الَّذِي جَاءَنِي جَالِسٌ عَلَى كُرْسِيٍّ بَيْنَ السَّمَاءِ وَالْأَرْضِ ، فَرُعِبْتُ مِنْهُ ، فَرَجَعْتُ فَقُلْتُ: زَمِّلُونِي ، فَأَنْزَلَ اللهُ تَعَالَى: { يَا أَيُّهَا الْمُدَّثِّرُ * قُمْ فَأَنْذِرْ } إِلَى [1/8] قَوْلِهِ { وَالرُّجْزَ فَاهْجُرْ فَحَمِيَ الْوَحْيُ وَتَتَابَعَ"
 },
 {
   "ids": "6047-6416-6042-2209-3529-",
   "sanad": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ ، قَالَ: حَدَّثَنَا أَبُو عَوَانَةَ ، قَالَ: حَدَّثَنَا مُوسَى بْنُ أَبِي عَائِشَةَ ، قَالَ: حَدَّثَنَا سَعِيدُ بْنُ جُبَيْرٍ ، عَنِ ابْنِ عَبَّاسٍ ،",
   "matn": "فِي قَوْلِهِ تَعَالَى: لا تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ } قَالَ: كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُعَالِجُ مِنَ التَّنْزِيلِ شِدَّةً ، وَكَانَ مِمَّا يُحَرِّكُ شَفَتَيْهِ فَقَالَ ابْنُ عَبَّاسٍ : فَأَنَا أُحَرِّكُهُمَا لَكُمْ كَمَا كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُحَرِّكُهُمَا ، وَقَالَ سَعِيدٌ : أَنَا أُحَرِّكُهُمَا كَمَا رَأَيْتُ ابْنَ عَبَّاسٍ يُحَرِّكُهُمَا ، فَحَرَّكَ شَفَتَيْهِ فَأَنْزَلَ اللهُ تَعَالَى: { لا تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ إِنَّ عَلَيْنَا جَمْعَهُ وَقُرْآنَهُ } قَالَ: جَمْعُهُ لَهُ فِي صَدْرِكَ وَتَقْرَأَهُ: { فَإِذَا قَرَأْنَاهُ فَاتَّبِعْ قُرْآنَهُ } قَالَ فَاسْتَمِعْ لَهُ وَأَنْصِتْ : { ثُمَّ إِنَّ عَلَيْنَا بَيَانَهُ } ثُمَّ إِنَّ عَلَيْنَا أَنْ تَقْرَأَهُ ، فَكَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعْدَ ذَلِكَ إِذَا أَتَاهُ جِبْرِيلُ اسْتَمَعَ ، فَإِذَا انْطَلَقَ جِبْرِيلُ قَرَأَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَمَا قَرَأَهُ"
 },
 {
   "ids": "3989-1585-4221-3600-",
   "sanad": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُوسَى قَالَ: أَخْبَرَنَا حَنْظَلَةُ بْنُ أَبِي سُفْيَانَ ، عِكْرِمَةَ بْنِ خَالِدٍ ، عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ:",
   "matn": "بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ : شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللهِ ، وَإِقَامِ الصَّلَاةِ ، وَإِيتَاءِ الزَّكَاةِ ، وَالْحَجِّ ، وَصَوْمِ رَمَضَانَ"
 },
 {
   "ids": "3691-3826-2438-3445-1799-3140-",
   "sanad": "حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ ، قَالَ: حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ ، قَالَ: سُلَيْمَانُ بْنُ بِلَالٍ ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ ، عَنْ أَبِي صَالِحٍ ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ:",
   "matn": "الْإِيمَانُ بِضْعٌ وَسِتُّونَ شُعْبَةً ، وَالْحَيَاءُ شُعْبَةٌ مِنَ الْإِيمَانِ"
 },
 {
   "ids": "1-2626-3338-592-2908-3614-",
   "sanad": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ ، قَالَ: حَدَّثَنَا شُعْبَةُ ، عَنْ عَبْدِ اللهِ بْنِ أَبِي السَّفَرِ وَإِسْمَاعِيلَ ، عَنِ الشَّعْبِيِّ ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو رَضِيَ اللهُ عَنْهُمَا ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ، قَالَ:",
   "matn": "الْمُسْلِمُ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ ، وَالْمُهَاجِرُ مَنْ هَجَرَ مَا نَهَى اللهُ عَنْهُ"
 },
 {
   "ids": "2310-6550-839-2917-3646-",
   "sanad": "حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى بْنِ سَعِيدٍ الْقُرَشِيُّ [1/12] قَالَ: حَدَّثَنَا أَبِي قَالَ: أَبُو بُرْدَةَ بْنُ عَبْدِ اللهِ بْنِ أَبِي بُرْدَةَ ، عَنْ أَبِي بُرْدَةَ ، عَنْ أَبِي مُوسَى رَضِيَ اللهُ عَنْهُ قَالَ:",
   "matn": "قَالُوا: يَا رَسُولَ اللهِ ، أَيُّ الْإِسْلَامِ أَفْضَلُ؟ قَالَ: مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ"
 },
 {
   "ids": "4566-5065-6647-5709-3614-",
   "sanad": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ قَالَ: حَدَّثَنَا اللَّيْثُ ، عَنْ يَزِيدَ ، عَنْ أَبِي الْخَيْرِ ، عَبْدِ اللهِ بْنِ عَمْرٍو رَضِيَ اللهُ عَنْهُمَا:",
   "matn": "أَنَّ رَجُلًا سَأَلَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: أَيُّ الْإِسْلَامِ خَيْرٌ؟ قَالَ: تُطْعِمُ الطَّعَامَ ، وَتَقْرَأُ السَّلَامَ عَلَى مَنْ عَرَفْتَ وَمَنْ لَمْ تَعْرِفْ"
 },
 {
   "ids": "1495-2632-3446-3239-3140-",
   "sanad": "حَدَّثَنَا أَبُو الْيَمَانِ قَالَ: أَخْبَرَنَا شُعَيْبٌ قَالَ: حَدَّثَنَا أَبُو الزِّنَادِ ، أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ: أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ:",
   "matn": "فَوَالَّذِي نَفْسِي بِيَدِهِ لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى أَكُونَ أَحَبَّ إِلَيْهِ مِنْ وَالِدِهِ وَوَلَدِهِ"
 },
 {
   "ids": "5580-3870-794-3468-762-",
   "sanad": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ: حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ قَالَ: عَنْ أَبِي قِلَابَةَ ، عَنْ أَنَسٍ ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ:",
   "matn": "ثَلَاثٌ مَنْ كُنَّ فِيهِ وَجَدَ حَلَاوَةَ الْإِيمَانِ : أَنْ يَكُونَ اللهُ وَرَسُولُهُ أَحَبَّ إِلَيْهِ مِمَّا سِوَاهُمَا ، وَأَنْ يُحِبَّ الْمَرْءَ لَا يُحِبُّهُ إِلَّا لِلهِ ، وَأَنْ يَكْرَهَ أَنْ يَعُودَ فِي الْكُفْرِ كَمَا يَكْرَهُ أَنْ يُقْذَفَ فِي النَّارِ"
 },
 {
   "ids": "6334-2626-3559-762-",
   "sanad": "حَدَّثَنَا أَبُو الْوَلِيدِ قَالَ: حَدَّثَنَا شُعْبَةُ قَالَ: أَخْبَرَنِي عَبْدُ اللهِ بْنُ عَبْدِ اللهِ بْنِ جَبْرٍ قَالَ: سَمِعْتُ أَنَسًا ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ:",
   "matn": "آيَةُ الْإِيمَانِ حُبُّ وَآيَةُ النِّفَاقِ بُغْضُ الْأَنْصَارِ ."
 },
 {
   "ids": "1495-2632-5595-2862-2955-",
   "sanad": "حَدَّثَنَا أَبُو الْيَمَانِ قَالَ: أَخْبَرَنَا شُعَيْبٌ ، عَنِ الزُّهْرِيِّ قَالَ: أَخْبَرَنِي أَبُو إِدْرِيسَ عَائِذُ اللهِ بْنُ عَبْدِ اللهِ: أَنَّ عُبَادَةَ بْنَ الصَّامِتِ رَضِيَ اللهُ عَنْهُ ، وَكَانَ شَهِدَ وَهُوَ أَحَدُ النُّقَبَاءِ لَيْلَةَ الْعَقَبَةِ :",
   "matn": "أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ ، وَحَوْلَهُ عِصَابَةٌ مِنْ أَصْحَابِهِ: بَايِعُونِي عَلَى أَنْ لَا تُشْرِكُوا بِاللهِ شَيْئًا ، وَلَا تَسْرِقُوا ، وَلَا تَزْنُوا ، وَلَا تَقْتُلُوا أَوْلَادَكُمْ ، [1/13] وَلَا تَأْتُوا بِبُهْتَانٍ تَفْتَرُونَهُ بَيْنَ أَيْدِيكُمْ وَأَرْجُلِكُمْ ، وَلَا تَعْصُوا فِي مَعْرُوفٍ ، فَمَنْ وَفَّى مِنْكُمْ فَأَجْرُهُ عَلَى اللهِ ، وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا فَعُوقِبَ فِي الدُّنْيَا فَهُوَ كَفَّارَةٌ لَهُ ، وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا ثُمَّ سَتَرَهُ اللهُ فَهُوَ إِلَى اللهِ ، إِنْ شَاءَ عَفَا عَنْهُ وَإِنْ شَاءَ عَاقَبَهُ . فَبَايَعْنَاهُ عَلَى ذَلِكَ"
 },
 {
   "ids": "3708-5077-3170-3536-2182-",
   "sanad": "حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ ، عَنْ مَالِكٍ ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ ، عَنْ أَبِيهِ ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّهُ قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ:",
   "matn": "يُوشِكُ أَنْ يَكُونَ خَيْرَ مَالِ الْمُسْلِمِ غَنَمٌ يَتْبَعُ بِهَا شَعَفَ الْجِبَالِ وَمَوَاقِعَ الْقَطْرِ ، يَفِرُّ بِدِينِهِ مِنَ الْفِتَنِ"
 },
 {
   "ids": "5337-3876-6336-4132-2864-",
   "sanad": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَّامٍ قَالَ: أَخْبَرَنَا عَبْدَةُ ، عَنْ هِشَامٍ ، عَنْ قَالَتْ:",
   "matn": "كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِذَا أَمَرَهُمْ أَمَرَهُمْ مِنَ الْأَعْمَالِ بِمَا يُطِيقُونَ ، قَالُوا: إِنَّا لَسْنَا كَهَيْئَتِكَ يَا رَسُولَ اللهِ ، إِنَّ اللهَ قَدْ غَفَرَ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ ، فَيَغْضَبُ حَتَّى يُعْرَفَ الْغَضَبُ فِي وَجْهِهِ ، ثُمَّ يَقُولُ: إِنَّ أَتْقَاكُمْ وَأَعْلَمَكُمْ بِاللهِ أَنَا"
 }
]